Updated README, added Github-Actions, performed project cleanup
